project/src/Catalogs/Конвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Конвертации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертацией</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертациейОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойУдаления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтложеннымЗаполнением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтправкойИнформацииОбУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередПолучениемИзмененныхОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиПравилОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеПолученияИнформацииОбУзлахОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриПолученииИнформацииОбУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия82</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБазы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоОбъектамВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПереводИменОбъектовФормата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДляСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРазделениеМодуля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТипизациюПеременных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонфигурацияКорреспондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайловойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыгрузкиРазделенногоМодуля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыгрузкиРазделенногоМодуля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииФормата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерсияФормата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииФормата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстанавливатьВДиалоге</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуетсяПриЗагрузке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьПараметрПриВыгрузке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоКонвертации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВременнаяКопия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Enums/СпособыВыгрузкиРазделенногоМодуля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СпособыВыгрузкиРазделенногоМодуля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФайлыTXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлыXML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

project/src/Enums/РазделыДополнительныхМодулей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>РазделыДополнительныхМодулей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алгоритмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПолучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользовательский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПолучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Базисный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

project/src/Catalogs/СоставыКонвертаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СоставыКонвертаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конвертации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементКонвертации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииПредопределенныхДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Алгоритмы</v8:Type>
						<v8:Type>cfg:CatalogRef.Запросы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/Конвертации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьИменаОбработчиков();
	ОбновитьИндикациюОбработчиков();
	ЗаполнитьПараметрыВыбораВерсииФормата();
	ОбновитьЗаголовокКнопкиРежимОтображения();
	Элементы.Параметры.ОтборСтрок = Новый ФиксированнаяСтруктура("ВременнаяКопия", Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТипКонвертации") Тогда
		Объект.ТипКонвертации = Параметры.ТипКонвертации;
	КонецЕсли;
	Если Параметры.Свойство("Родитель") Тогда
		Объект.Родитель = Параметры.Родитель;
	КонецЕсли;
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	ЗаполнитьОтборРодителяВерсииФормата();
	КонвертацияXDTO = (Объект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO);
	ДобавитьОбновитьОтборДинамическогоСпискаМодули();
	УстановитьВидимость();
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ДобавитьОбновитьОтборДинамическогоСпискаМодули();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	ОбновитьИндикациюОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура ВерсииФорматаПослеУдаления(Элемент)
	Если Объект.ВерсииФормата.Количество() = 0 Тогда
		ЗаполнитьПараметрыВыбораВерсииФормата(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВерсииФорматаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И НЕ ОтменаРедактирования Тогда
		Если НЕ ЗначениеЗаполнено(ВерсияФорматаОтборРодитель) Тогда
			ЗаполнитьОтборРодителяВерсииФормата();
		КонецЕсли;
		ЗаполнитьПараметрыВыбораВерсииФормата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаДляСохранения_МодульМенеджераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НастройкиДиалога = Новый Структура;
	МодульОбменДаннымиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиКлиент"); 
	СтандартнаяОбработка = Ложь;
	НастройкиДиалога.Вставить("Режим", РежимДиалогаВыбораФайла.Сохранение); 
	Если Элемент = Элементы.ИмяФайлаДляСохранения_МодульМенеджера Тогда
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Укажите файл для сохранения модуля менеджера'")); 
	ИначеЕсли Элемент = Элементы.ИмяФайлаДляСохранения_НесколькоМодулей Тогда
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Укажите каталог для сохранения модулей менеджера'")); 
		НастройкиДиалога.Вставить("Режим", РежимДиалогаВыбораФайла.ВыборКаталога);
	Иначе
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Укажите файл для сохранения правил'"));
		НастройкиДиалога.Вставить("Фильтр", НСтр("ru='(*.xml)|*.xml'"));
	КонецЕсли;
	МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "ИмяФайлаДляСохранения", СтандартнаяОбработка, НастройкиДиалога);
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьНесколькоМодулейПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИспользоватьРазделениеМодуля = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Сначала необходимо записать Конвертацию.'"));
		Возврат;
	КонецЕсли;
	ИспользоватьНесколькоМодулейПриИзмененииНаСервере();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СпособВыгрузкиРазделенногоМодуляПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияФорматаМенеджераПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти  
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ИзменитьРежимОтображения(Команда)
	ОтображатьДеревоМодулей = НЕ ОтображатьДеревоМодулей;
	ОбновитьЗаголовокКнопкиРежимОтображения();
	УстановитьВидимость();
	Если ОтображатьДеревоМодулей Тогда
		ЗаполнитьДеревоМодулейНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Гиперссылка_ПараметрыПодключенияНажатие(Элемент)
	Если ЭтаФорма.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Необходимо записать конвертацию.'"));
		Возврат;
	КонецЕсли;
	ОповещениеЗакрыто = Новый ОписаниеОповещения("ЗакрытаФормаНастройкиПараметров", ЭтаФорма);
	ОткрытьФорму("Справочник.Конвертации.Форма.ФормаЭлемента_ПараметрыПодключения",Новый Структура("Ключ", Объект.Ссылка),Объект,,,,ОповещениеЗакрыто, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКонфигурацию(Команда)
	Отказ = ПроверитьЗаполнениеНастроекПодключения(); 
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ЗапуститьКомандуЗагрузкиВыгрузкиКонфигурации(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонфигурацию(Команда)
	Отказ = ПроверитьЗаполнениеНастроекПодключения(); 
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ЗапуститьКомандуЗагрузкиВыгрузкиКонфигурации(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьКонвертациюВФайлы(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Необходимо записать конвертацию.'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ИмяФайлаДляСохранения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указан каталог выгрузки модулей.'"));
		Возврат;
	КонецЕсли;
	ИменаФайловДляСохранения = Новый Структура;
	НастройкиВыгрузки = Новый Структура;
	НастройкиВыгрузки = Новый Структура("РежимОчисткиМодулейМенеджера", Ложь);
	Модули = ВыгрузитьМодулиСервер(ИменаФайловДляСохранения, НастройкиВыгрузки);
	КонвертацияДанныхXDTOКлиент.СохранитьМодулиКонвертацииВФайлы(Модули, НастройкиВыгрузки, ИменаФайловДляСохранения);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонвертациюИзФайлов(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Необходимо записать конвертацию.'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ИмяФайлаДляСохранения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указан каталог выгрузки модулей.'"));
		Возврат;
	КонецЕсли; 
	ПараметрыЗагрузки = ПодготовитьПараметрыЗагрузкиМодулей();
	ДанныеДляЗагрузки = КонвертацияДанныхXDTOКлиент.ПодготовитьМодулиДляЗагрузки(ПараметрыЗагрузки);

	ЗагрузитьМодулиСервер(ДанныеДляЗагрузки);	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПравилаИзМодулейМенеджера(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Необходимо записать конвертацию.'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ИмяФайлаДляСохранения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указан каталог выгрузки модулей.'"));
		Возврат;
	КонецЕсли;
	ИменаФайловДляСохранения = Новый Структура;
	НастройкиВыгрузки = Новый Структура("РежимОчисткиМодулейМенеджера", Истина);
	Модули = ВыгрузитьМодулиСервер(ИменаФайловДляСохранения, НастройкиВыгрузки);
	КонвертацияДанныхXDTOКлиент.УдалитьПравилаИзМодулейМенеджера(НастройкиВыгрузки);
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗаполнитьИменаОбработчиков()
	Если КонвертацияXDTO Тогда
		ИмяОбработчикаПередКонвертацией 		= НСтр("ru='ПередКонвертацией'");
		ИмяОбработчикаПослеКонвертации 			= НСтр("ru='ПослеКонвертации'");
		ИмяОбработчикаПередОтложеннымЗаполнением = НСтр("ru='ПередОтложеннымЗаполнением'");
		ИмяОбработчикаПередОбработкойУдаления 		= НСтр("ru='ПередОбработкойУдаляемогоОбъекта'");
		Возврат;
	КонецЕсли;
	ИмяОбработчикаПослеЗагрузкиПравилОбмена 	= НСтр("ru='Конвертация_ПослеЗагрузкиПравилОбмена'");
	ИмяОбработчикаПередВыгрузкойДанных 			= НСтр("ru='Конвертация_ПередВыгрузкойДанных'");
	ИмяОбработчикаПередПолучениемИзмененных 	= НСтр("ru='Конвертация_ПередПолучениемИзмененныхОбъектов'");
	ИмяОбработчикаПередВыгрузкойОбъекта 		= НСтр("ru='Конвертация_ПередВыгрузкойОбъекта'");
	ИмяОбработчикаПередОтправкойУдаления 		= НСтр("ru='Конвертация_ПередОтправкойИнформацииОбУдалении'");
	ИмяОбработчикаПередКонвертациейОбъекта 		= НСтр("ru='Конвертация_ПередКонвертациейОбъекта'");
	ИмяОбработчикаПослеВыгрузкиОбъекта 			= НСтр("ru='Конвертация_ПослеВыгрузкиОбъекта'");
	ИмяОбработчикаПослеВыгрузкиДанных 			= НСтр("ru='Конвертация_ПослеВыгрузкиДанных'");
	ИмяОбработчикаПередЗагрузкойДанных 			= НСтр("ru='Конвертация_ПередЗагрузкойДанных'");
	ИмяОбработчикаПослеЗагрузкиПараметров 		= НСтр("ru='Конвертация_ПослеЗагрузкиПараметров'");
	ИмяОбработчикаПослеПолученияУзловОбмена 	= НСтр("ru='Конвертация_ПослеПолученияИнформацииОбУзлахОбмена'");
	ИмяОбработчикаПередЗагрузкойОбъекта 		= НСтр("ru='Конвертация_ПередЗагрузкойОбъекта'");
	ИмяОбработчикаПриПолученииУдаления 			= НСтр("ru='Конвертация_ПриПолученииИнформацииОбУдалении'");
	ИмяОбработчикаПослеЗагрузкиОбъекта 			= НСтр("ru='Конвертация_ПослеЗагрузкиОбъекта'");
	ИмяОбработчикаПослеЗагрузкиДанных 			= НСтр("ru='Конвертация_ПослеЗагрузкиДанных'");

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	// Шапка.
	Элементы.СтраницаКонвертацияXML.Видимость = НЕ КонвертацияXDTO;
	Элементы.СтраницаКонвертацияXDTO.Видимость = КонвертацияXDTO;
	Элементы.Конфигурация.Видимость = КонвертацияXDTO;
	Элементы.КонфигурацияИсточник.Видимость = НЕ КонвертацияXDTO;
	Элементы.КонфигурацияКорреспондент.Видимость = НЕ КонвертацияXDTO;
	Элементы.МодулиКонвертации.Видимость = КонвертацияXDTO И Объект.ИспользоватьРазделениеМодуля;
	Элементы.ИмяФайлаДляСохранения_МодульМенеджера.Доступность = НЕ Объект.ИспользоватьРазделениеМодуля; 
	Элементы.ИспользоватьНесколькоМодулей.Видимость = (Объект.ВерсияФорматаМенеджера <> "1");
	Элементы.ИспользоватьТипизациюПеременных.Видимость = (Объект.ВерсияФорматаМенеджера <> "1");
	Если КонвертацияXDTO И (Объект.ВерсияФорматаМенеджера <> "1") И Объект.ИспользоватьРазделениеМодуля Тогда
		Элементы.МодулиКонвертацииСписок.Видимость = НЕ ОтображатьДеревоМодулей;
		Элементы.ДеревоМодулей.Видимость = ОтображатьДеревоМодулей;
		Элементы.Создать.Доступность = НЕ ОтображатьДеревоМодулей; 
		ВыгрузкаВФайлыXML = (Объект.СпособВыгрузкиРазделенногоМодуля = Перечисления.СпособыВыгрузкиРазделенногоМодуля.ФайлыXML);
		Элементы.Гиперссылка_ПараметрыПодключения.Видимость = ВыгрузкаВФайлыXML;
		Элементы.ВыгрузитьКонфигурациюВФайлы.Видимость = ВыгрузкаВФайлыXML;   
		Элементы.ЗагрузитьКонфигурациюИзФайлов.Видимость = ВыгрузкаВФайлыXML;
		Элементы.ВыгрузитьКонвертациюВФайлы.Видимость = ВыгрузкаВФайлыXML;
		Элементы.ЗагрузитьКонвертациюИзФайлов.Видимость = ВыгрузкаВФайлыXML;  
		Элементы.УдалитьПравилаИзМодулейМенеджера.Видимость = ВыгрузкаВФайлыXML;
	КонецЕсли;
	
	// Таблица параметров.
	Для Каждого Колонка Из Элементы.Параметры.ПодчиненныеЭлементы Цикл
		Если Колонка.Имя = "ПараметрыПараметр" Тогда
			Колонка.Видимость = Истина;
		Иначе
			Колонка.Видимость = НЕ КонвертацияXDTO;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндикациюОбработчиков()
	Если КонвертацияXDTO Тогда
		КоллекцияСтраниц = Элементы.СтраницыОбработчики;
	Иначе
		КоллекцияСтраниц = Элементы.ОбработчикиXML;
	КонецЕсли;
	КонвертацияДанныхXDTOКлиент.ОбновитьИндикациюСтраницОбработчиков(КоллекцияСтраниц, Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборРодителяВерсииФормата()
	Если Объект.ВерсииФормата.Количество() = 0  Тогда
		// Не из чего заполнять или уже все заполнили.
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВерсияФорматаОтборРодитель) Тогда
		ВерсияФорматаОтборРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВерсииФормата[0].ВерсияФормата, "Родитель");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыВыбораВерсииФормата(РежимОчистки = Ложь)
	Если РежимОчистки Тогда
		ВерсияФорматаОтборРодитель = Неопределено;
		Элементы.ВерсииФорматаВерсияФормата.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		Возврат;
	ИначеЕсли Элементы.ВерсииФорматаВерсияФормата.ПараметрыВыбора.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбораВерсии = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Расширение", Ложь);
	ПараметрыВыбораВерсии.Добавить(НовыйПараметр);
	Если ЗначениеЗаполнено(ВерсияФорматаОтборРодитель) Тогда 
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Родитель", ВерсияФорматаОтборРодитель);
		ПараметрыВыбораВерсии.Добавить(НовыйПараметр);
	КонецЕсли;
	Элементы.ВерсииФорматаВерсияФормата.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВерсии);
КонецПроцедуры

&НаСервере
Процедура ИспользоватьНесколькоМодулейПриИзмененииНаСервере() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка, Раздел, ПометкаУдаления
	|ИЗ Справочник.ДополнительныеМодули
	|ГДЕ Владелец = &Конвертация";
	Запрос.УстановитьПараметр("Конвертация", Объект.Ссылка);
	Если Объект.ИспользоватьРазделениеМодуля Тогда
		Если НЕ ЗначениеЗаполнено(Объект.СпособВыгрузкиРазделенногоМодуля) Тогда
			Объект.СпособВыгрузкиРазделенногоМодуля = Перечисления.СпособыВыгрузкиРазделенногоМодуля.ФайлыTXT;
		КонецЕсли;
		ТабМодули = Запрос.Выполнить().Выгрузить();
		ПроверитьНаличиеМодуля(ТабМодули, Перечисления.РазделыДополнительныхМодулей.Алгоритмы);
		ПроверитьНаличиеМодуля(ТабМодули, Перечисления.РазделыДополнительныхМодулей.ДокументыОтправка);
		ПроверитьНаличиеМодуля(ТабМодули, Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение); 
		ПроверитьНаличиеМодуля(ТабМодули, Перечисления.РазделыДополнительныхМодулей.ПрочееОтправка);
        ПроверитьНаличиеМодуля(ТабМодули, Перечисления.РазделыДополнительныхМодулей.ПрочееПолучение);
		ПроверитьНаличиеМодуля(ТабМодули, Перечисления.РазделыДополнительныхМодулей.Базисный);
	Иначе   
		Объект.СпособВыгрузкиРазделенногоМодуля = Перечисления.СпособыВыгрузкиРазделенногоМодуля.ПустаяСсылка();
		// Все модули надо пометить на удаление.
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "ГДЕ ПометкаУдаления = ЛОЖЬ И ");
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДопМодульОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДопМодульОбъект.ОбменДанными.Загрузка = Истина;
			ДопМодульОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьНаличиеМодуля(ТабМодули, РазделМодуля) 
	Если ТабМодули.Количество() > 0 Тогда
		ИскомыйМодуль = ТабМодули.НайтиСтроки(Новый Структура("Раздел", РазделМодуля)); 
		Если ИскомыйМодуль.Количество() > 0 Тогда
			Если ИскомыйМодуль[0].ПометкаУдаления = Истина Тогда
				ДопМодульОбъект = ИскомыйМодуль[0].Ссылка.ПолучитьОбъект();
				ДопМодульОбъект.ОбменДанными.Загрузка = Истина;
				ДопМодульОбъект.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	ДопМодульОбъект = Справочники.ДополнительныеМодули.СоздатьЭлемент();
	ДопМодульОбъект.Владелец = Объект.Ссылка;
	ДопМодульОбъект.Раздел = РазделМодуля;
	ДопМодульОбъект.Наименование = Справочники.ДополнительныеМодули.НаименованиеПоУмолчанию(РазделМодуля); 
	ДопМодульОбъект.ОбменДанными.Загрузка = Истина;
	ДопМодульОбъект.Записать();
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбновитьОтборДинамическогоСпискаМодули()
	ОтборНайден = Ложь;
	Для Каждого ЭлементОтбора Из МодулиКонвертации.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.Конвертации") Тогда
			ОтборНайден = Истина;
			ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ОтборНайден Тогда
		ЭлементОтбора = МодулиКонвертации.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКнопкиРежимОтображения()
	Если ОтображатьДеревоМодулей Тогда
		ЗаголовокКнопки = НСтр("ru='Отобразить список'");
	Иначе 
		ЗаголовокКнопки = НСтр("ru='Отобразить дерево'");
	КонецЕсли; 
	Элементы.ИзменитьРежимОтображения.Заголовок = ЗаголовокКнопки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоМодулейНаСервере() 
	ВеткиДерева = ДеревоМодулей.ПолучитьЭлементы();
	ВеткиДерева.Очистить(); 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Конвертация", Объект.Ссылка); 
	ТекстЗапроса = "" + ЗаполнитьПодзапрос("""ПОД""", "ПравилаОбработкиДанных") + "
	|ОБЪЕДИНИТЬ ВСЕ 
	|" + ЗаполнитьПодзапрос("""ПКО""", "ПравилаКонвертацииОбъектов") + "
	|ОБЪЕДИНИТЬ ВСЕ
	|" + ЗаполнитьПодзапрос("""Алгоритмы""", "Алгоритмы");
	ТекстЗапроса = "ВЫБРАТЬ 
	|	Свод.Ссылка КАК ПравилоСсылка,
	|	Свод.РазделПоУмолчанию,
	|	Свод.ДополнительныйМодуль,
	|	Свод.Ветка КАК Ветка,
	|	Модули.Ссылка КАК МодульСсылка,
	|	Модули.Раздел КАК РазделМодуля
	|ИЗ (" + ТекстЗапроса + ") КАК Свод  
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДополнительныеМодули КАК Модули 
	|	ПО Свод.ДополнительныйМодуль = Модули.Ссылка 
	|	ИЛИ (Свод.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка) И Модули.Раздел = Свод.РазделПоУмолчанию)
	|ГДЕ Модули.Владелец = &Конвертация
	|ИТОГИ ПО Модули.Ссылка, Свод.Ветка";
	Запрос.Текст = ТекстЗапроса;
	ВыборкаМодуль = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМодуль.Следующий() Цикл
		ЭлементУровня0 = ВеткиДерева.Добавить();
		ЭлементУровня0.Элемент = ВыборкаМодуль.МодульСсылка;
		ЭлементУровня0.ИндексКартинки = ?(ВыборкаМодуль.РазделМодуля = Перечисления.РазделыДополнительныхМодулей.Пользовательский,3,5);
		ВыборкаВетка = ВыборкаМодуль.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ЭлементыУровня1 = ЭлементУровня0.ПолучитьЭлементы();
		Пока ВыборкаВетка.Следующий() Цикл
			ЭлементУровня1 = ЭлементыУровня1.Добавить();
			ЭлементУровня1.Элемент = ВыборкаВетка.Ветка;
			ЭлементУровня1.ИндексКартинки = 2; 
			ВыборкаПравило = ВыборкаВетка.Выбрать();
			ЭлементыУровня2 = ЭлементУровня1.ПолучитьЭлементы();

			Пока ВыборкаПравило.Следующий() Цикл
				ЭлементУровня2 = ЭлементыУровня2.Добавить();
				ЭлементУровня2.Элемент = ВыборкаПравило.ПравилоСсылка; 
				ЭлементУровня2.ИндексКартинки = 5;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	// Добавим ветки дерева с модулями менеджера.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Конвертация", Объект.Ссылка);
	Запрос.Текст = ЗаполнитьПодзапросМодулиМенеджера();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаОбъект = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	 Пока ВыборкаОбъект.Следующий() Цикл
			ЭлементУровня0 = ВеткиДерева.Добавить();
			ЭлементУровня0.Элемент = ВыборкаОбъект.Объект;
			ЭлементУровня0.ИндексКартинки = 3;
			ВыборкаВетка = ВыборкаОбъект.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ЭлементыУровня1 = ЭлементУровня0.ПолучитьЭлементы();
			Пока ВыборкаВетка.Следующий() Цикл
				ЭлементУровня1 = ЭлементыУровня1.Добавить();
				ЭлементУровня1.Элемент = ВыборкаВетка.Ветка;
				ЭлементУровня1.ИндексКартинки = 2; 
				ВыборкаПравило = ВыборкаВетка.Выбрать();
				ЭлементыУровня2 = ЭлементУровня1.ПолучитьЭлементы();

				Пока ВыборкаПравило.Следующий() Цикл
					ЭлементУровня2 = ЭлементыУровня2.Добавить();
					ЭлементУровня2.Элемент = ВыборкаПравило.ПравилоСсылка; 
					ЭлементУровня2.ИндексКартинки = 5;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПодзапрос(Ветка, ИмяСправочника) 
	ТекстЗапроса = "ВЫБРАТЬ 
	|	Правила.Ссылка,
	|	%Раздел% КАК РазделПоУмолчанию,
	|	ДополнительныйМодуль,
	|	" + Ветка + " КАК Ветка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила 
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ 
	|	И (Правила.Захвачен = ЛОЖЬ
	|	ИЛИ Правила.Копия = ИСТИНА)
	|";
	Если ИмяСправочника = "Алгоритмы" Тогда
		Подзапрос = "ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Алгоритмы)";
	ИначеЕсли ИмяСправочника = "ПравилаОбработкиДанных" Тогда
		Подзапрос = "ВЫБОР КОГДА Правила.ВыгружатьВМодульМенеджера ТОГДА NULL
		|	КОГДА Правила.ИспользоватьДляОтправки 
		|	И (ЕстьNULL(ВЫРАЗИТЬ(Правила.ОбъектВыборки КАК Справочник.Объекты).Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
		|		ИЛИ Правила.Наименование ПОДОБНО ""%Документ%"") ТОГДА 
		|		ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.ДокументыОтправка)
		|	КОГДА Правила.ИспользоватьДляОтправки 
		|	И НЕ (ЕстьNULL(ВЫРАЗИТЬ(Правила.ОбъектВыборки КАК Справочник.Объекты).Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
		|		ИЛИ (Правила.Наименование ПОДОБНО ""%Документ.%"")) ТОГДА
		|		ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.ПрочееОтправка)
        |	КОГДА Правила.ИспользоватьДляПолучения 
		|	И (ВЫРАЗИТЬ(Правила.ОбъектВыборки КАК Строка(50)) ПОДОБНО ""Документ."" ИЛИ Правила.Наименование ПОДОБНО ""%Документ%"") ТОГДА
		|		ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.ДокументыПолучение)
		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.ПрочееПолучение)
        |	КОНЕЦ ";  
	Иначе
		Подзапрос = "ВЫБОР КОГДА Правила.ВыгружатьВМодульМенеджера ТОГДА NULL
		|	КОГДА Правила.ИспользоватьДляОтправки
		|	И (ЕстьNULL(Правила.ОбъектКонфигурации.Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
		|		ИЛИ (Правила.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
		|			И Правила.ОбъектФормата ПОДОБНО ""Документ.%"" )) ТОГДА
		|		ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.ДокументыОтправка)
        |	КОГДА Правила.ИспользоватьДляОтправки
		|	И НЕ (ЕстьNULL(Правила.ОбъектКонфигурации.Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
		|		ИЛИ (Правила.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
		|			И Правила.ОбъектФормата ПОДОБНО ""Документ.%"" )) ТОГДА
		|		ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.ПрочееОтправка)
		|	КОГДА Правила.ИспользоватьДляОтправки = ЛОЖЬ И Правила.ИспользоватьДляПолучения = ИСТИНА
		|	И (ЕстьNULL(Правила.ОбъектКонфигурации.Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
		|		ИЛИ (Правила.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
		|			И Правила.ОбъектФормата ПОДОБНО ""Документ.%"" )) ТОГДА
		|		ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.ДокументыПолучение)
 		|	ИНАЧЕ
		|		ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.ПрочееПолучение)
        |	КОНЕЦ "; 
	КонецЕсли; 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Раздел%", Подзапрос);
	Возврат ТекстЗапроса;
КонецФункции

&НаСервере
Функция ЗаполнитьПодзапросМодулиМенеджера()
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Свод.Ссылка КАК ПравилоСсылка,
	|	Свод.Объект.Наименование КАК Объект,
	|	Свод.Ветка КАК Ветка
	|ИЗ
	|	(ВЫБРАТЬ  
	|		Правила.Ссылка,
	|		ВЫБОР КОГДА Правила.ОбъектКонфигурацииДляВыгрузкиМодуля <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка) ТОГДА 
	|			Правила.ОбъектКонфигурацииДляВыгрузкиМодуля
	|		КОГДА Правила.ИспользоватьДляОтправки И ВЫРАЗИТЬ(Правила.ОбъектВыборки КАК Справочник.Объекты) <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка) ТОГДА
	|			Правила.ОбъектВыборки
	|		ИНАЧЕ ПКО.ОбъектКонфигурации КОНЕЦ КАК Объект,
	|		""ПОД"" КАК Ветка
	|	ИЗ Справочник.ПравилаОбработкиДанных КАК Правила
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|	ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|		И СоставыКонвертаций.Владелец = &Конвертация
	|		И СоставыКонвертаций.Отключить = ЛОЖЬ 
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|		ПО ПКО.Код = Правила.ПравилоКонвертацииОбъекта
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций2
	|	ПО СоставыКонвертаций2.ЭлементКонвертации = ПКО.Ссылка
	|		И СоставыКонвертаций2.Владелец = &Конвертация
	|		И СоставыКонвертаций2.Отключить = ЛОЖЬ 
	|	ГДЕ Правила.ПометкаУдаления = ЛОЖЬ И Правила.ВыгружатьВМодульМенеджера = ИСТИНА 
	|		И (Правила.Захвачен = ЛОЖЬ
	|		ИЛИ Правила.Копия = ИСТИНА)
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ  
	|		Правила.Ссылка,  
	|		ВЫБОР КОГДА Правила.ОбъектКонфигурацииДляВыгрузкиМодуля <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка) ТОГДА 
	|			Правила.ОбъектКонфигурацииДляВыгрузкиМодуля
    |		ИНАЧЕ Правила.ОбъектКонфигурации КОНЕЦ,
	|		""ПКО""
	|	ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правила
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|	ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|		И СоставыКонвертаций.Владелец = &Конвертация
	|		И СоставыКонвертаций.Отключить = ЛОЖЬ 
	|	ГДЕ Правила.ПометкаУдаления = ЛОЖЬ И Правила.ВыгружатьВМодульМенеджера = ИСТИНА 
	|		И (Правила.Захвачен = ЛОЖЬ
	|		ИЛИ Правила.Копия = ИСТИНА)) КАК Свод
	|ИТОГИ ПО
	|	Свод.Объект.Наименование, Свод.Ветка"; 
	Возврат ТекстЗапроса;
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеНастроекПодключения()
	МассивПроверяемыхРеквизитов = Новый Массив;
	МассивПроверяемыхРеквизитов.Добавить("ПользовательБазыДанных"); 
	Если Объект.ВидБазы = 0 Тогда
		МассивПроверяемыхРеквизитов.Добавить("ПолноеИмяФайловойБазы");
	Иначе
		МассивПроверяемыхРеквизитов.Добавить("СерверБазыДанных");
		МассивПроверяемыхРеквизитов.Добавить("ИмяБазыДанных");
	КонецЕсли; 
	Отказ = Ложь;
	Для Каждого Рекв Из МассивПроверяемыхРеквизитов Цикл
		Если НЕ ЗначениеЗаполнено(Объект[Рекв]) Тогда
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	Если Отказ Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнены параметры подключения к базе. Действие не может быть выполнено.'"));
	КонецЕсли;
	Возврат Отказ;
КонецФункции

&НаСервере
Процедура ЗапуститьКомандуЗагрузкиВыгрузкиКонфигурации(ЭтоВыгрузка)
	ФайлКоманды = Новый ТекстовыйДокумент; 
	ФайлКомандыБат = ПолучитьИмяВременногоФайла(".bat");
	
	СтрокаКоманды = """%КаталогПрограммы%1cv8.exe"" DESIGNER %КлючВидБазы%""%ПутьКБазе%"" /N ""%ИмяПользователя%"" /P ""%ПарольПользователя%""  /DisableStartupMessages /DisableStartupDialogs %КлючВыгрузкаЗагрузка% ""%Каталог%""";
	
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%КаталогПрограммы%", КаталогПрограммы()); 
	Если Объект.ВидБазы = 0 Тогда
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%КлючВидБазы%", "/F");
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%ПутьКБазе%", СокрЛП(Объект.ПолноеИмяФайловойБазы));
	Иначе
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%КлючВидБазы%", "/S");
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%ПутьКБазе%", СокрЛП(Объект.СерверБазыДанных) + "\" + СокрЛП(Объект.ИмяБазыДанных));
	КонецЕсли; 
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%ИмяПользователя%", СокрЛП(Объект.ПользовательБазыДанных));
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%ПарольПользователя%", СокрЛП(Объект.ПарольПользователя));
	Если ЭтоВыгрузка Тогда
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%КлючВыгрузкаЗагрузка%", "/DumpConfigToFiles");
	Иначе  
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%КлючВыгрузкаЗагрузка%", "/LoadConfigFromFiles");
	КонецЕсли;
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%Каталог%", СокрЛП(Объект.ИмяФайлаДляСохранения));
	
	ФайлКоманды.ДобавитьСтроку("@ECHO OFF");
	ФайлКоманды.ДобавитьСтроку(СтрокаКоманды);

	ФайлКоманды.Записать(ФайлКомандыБат, КодировкаТекста.OEM);
	
	КодВозврата = 0;
	ТекстОшибки = "";
	Попытка
	ЗапуститьПриложение(ФайлКомандыБат, , Истина, КодВозврата);
	Исключение 
	ТекстОшибки = ОписаниеОшибки();
	КонецПопытки; 

	Если КодВозврата = 0 И ТекстОшибки = "" Тогда
		ТекстСообщения = НСтр("ru='Операция %Операция% прошла успешно'");
	Иначе
		ТекстСообщения = НСтр("ru='Операция %Операция% не выполнена'") + " " + ТекстОшибки;
	КонецЕсли;
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Операция%", ?(ЭтоВыгрузка, НСтр("ru='выгрузка конфигурации в файлы'"), НСтр("ru=' загрузка конфигурации из файлов'")));
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Попытка
		УдалитьФайлы(ФайлКомандыБат);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ВыгрузитьМодулиСервер(ИменаФайловДляСохранения, НастройкиВыгрузки) 
	Обработки.ВыгрузкаМодуля.ПодготовитьНастройкиВыгрузкиМодулей(Объект.Ссылка, ИменаФайловДляСохранения, НастройкиВыгрузки);
	Если НастройкиВыгрузки.РежимОчисткиМодулейМенеджера = Истина Тогда
		Возврат Неопределено;
	Иначе
		ОбработкаОбъект = Обработки.ВыгрузкаМодуля.Создать(); 
		ОбработкаОбъект.Конвертация = Объект.Ссылка;
		ОбработкаОбъект.ПоСостояниюХранилища = Истина;
	    Результат = ОбработкаОбъект.ВыполнитьВыгрузкуМодулей();
		Возврат Результат;
	КонецЕсли;
КонецФункции 

&НаСервере
Процедура ЗагрузитьМодулиСервер(ДанныеДляЗагрузки)
	
	СтруктураПараметров = Новый Структура("ИсточникЗагрузки, Конвертация, СоздатьНовуюКонвертацию", 3, Объект.Ссылка, Ложь); 
	СтруктураПараметров.Вставить("ИмяНовойКонвертации", "");
	СтруктураПараметров.Вставить("ДанныеДляЗагрузки", ДанныеДляЗагрузки);
	СтруктураПараметров.Вставить("Конфигурация", Объект.Конфигурация);
	СтруктураПараметров.Вставить("ТолькоОбработчики", Ложь);
	СтруктураПараметров.Вставить("ИтерацияЗагрузки", 1); 
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);

	Обработки.ЗагрузкаМодуляМенеджера.ВыполнитьЗагрузкуМодуляМенеджера(СтруктураПараметров, АдресРезультата);
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресРезультата); 
	РезультатЗагрузкиУспешно = Ложь;
	РезультатЗагрузкиОшибки = "";
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		РезультатЗагрузкиУспешно = РезультатЗагрузки.Успешно;
		РезультатЗагрузкиОшибки = РезультатЗагрузки.Ошибки;
		Если РезультатЗагрузкиУспешно = Истина Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Загрузка конвертации прошла успешно'"));
		Иначе
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Загрузка конвертации не выполнена'")); 
			Если ЗначениеЗаполнено(РезультатЗагрузкиОшибки) Тогда
				ОбщегоНазначения.СообщитьПользователю(РезультатЗагрузкиОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыЗагрузкиМодулей()
	ИмяБазисногоМодуля = "МенеджерОбменаЧерезУниверсальныйФормат";
	МодулиКонвертацииДляЗагрузки = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Раздел, Наименование
	|ИЗ Справочник.ДополнительныеМодули
	|ГДЕ Владелец = &Конвертация"; 
	Запрос.УстановитьПараметр("Конвертация", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Раздел = Перечисления.РазделыДополнительныхМодулей.Базисный Тогда
			ИмяБазисногоМодуля = СокрЛП(Выборка.Наименование);
			Продолжить;
		КонецЕсли; 
		МодулиКонвертацииДляЗагрузки.Добавить(СокрЛП(Выборка.Наименование));
	КонецЦикла;
	ПараметрыЗагрузки = Новый Структура("ИсточникЗагрузки, ИмяФайлаЗагрузки, МодулиКонвертации", 3, Объект.ИмяФайлаДляСохранения, МодулиКонвертацииДляЗагрузки);
	ПараметрыЗагрузки.Вставить("ИмяГлобальногоМодуля", ИмяБазисногоМодуля); 
	ПараметрыЗагрузки.Вставить("ТекстГлобальногоМодуля", "");

	// Получение текста модуля.
	ПодходящийКаталог = НайтиФайлы(Объект.ИмяФайлаДляСохранения + "/CommonModules","*" + ИмяБазисногоМодуля,Истина);
	Если ПодходящийКаталог.Количество() = 0
		Или НЕ ПодходящийКаталог[0].ЭтоКаталог() Тогда 
		Возврат ПараметрыЗагрузки;
	Иначе
		ПутьКМодулю = ПодходящийКаталог[0].ПолноеИмя + "/Ext";
		ПодходящиеФайлы = НайтиФайлы(ПутьКМодулю,"Module.bsl",Ложь); 
		Если ПодходящиеФайлы.Количество() = 0 Тогда
			Возврат ПараметрыЗагрузки;
		КонецЕсли;
	КонецЕсли;   
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
	КопироватьФайл(ПодходящиеФайлы[0].ПолноеИмя, ИмяВременногоФайла);
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(СокрЛП(ИмяВременногоФайла), КодировкаТекста.UTF8);
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ИмяВременногоФайла = "";
	КонецПопытки; 
	ПараметрыЗагрузки.Вставить("ТекстГлобальногоМодуля", ТекстДок);
	Возврат ПараметрыЗагрузки; 
КонецФункции

Процедура ЗакрытаФормаНастройкиПараметров(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	ЭтаФорма.Прочитать();
КонецПроцедуры





#КонецОбласти
